//=============================================================================
//
// オブジェクトライト処理 [objlight.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_OBJLIGHT		(1)					// エネミーの数

#define	OBJLIGHT_SIZE		(5.0f)				// 当たり判定の大きさ


//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct OBJLIGHT
{
	XMFLOAT4X4			mtxWorld;			// ワールドマトリックス
	XMFLOAT3			pos;				// モデルの位置
	XMFLOAT3			rot;				// モデルの向き(回転)
	XMFLOAT3			scl;				// モデルの大きさ(スケール)

	BOOL				use;
	BOOL				load;
	DX11_MODEL			model;				// モデル情報
	XMFLOAT4			diffuse[MODEL_MAX_MATERIAL];	// モデルの色

	float		w, h;			// 幅と高さ
	float				spd;				// 移動スピード
	float				size;				// 当たり判定の大きさ
	int					shadowIdx;			// 影のインデックス番号

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitObjlight(void);
void UninitObjlight(void);
void UpdateObjlight(void);
void DrawObjlight(void);

OBJLIGHT* GetObjlight(void);
