//=============================================================================
//
// エネミーモデル処理 [enemy.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_PROP		(5)					// エネミーの数

#define	ENEMY_SIZE		(5.0f)				// 当たり判定の大きさ




//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct PROP
{
	XMFLOAT4X4			mtxWorld;			// ワールドマトリックス
	XMFLOAT3			pos;				// モデルの位置
	XMFLOAT3			rot;				// モデルの向き(回転)
	XMFLOAT3			scl;				// モデルの大きさ(スケール)

	BOOL				use;
	BOOL				load;
	int			modelNo;				// モデル情報
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitProp(void);
void UninitProp(void);
void UpdateProp(void);
void DrawProp(void);

int GetRand(int min, int max);
